In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = {'Company':['FB', 'FB', 'GO', 'GO', 'MS', 'MS'], 'Persons': ['Daniel', 'Mike', 'Ritah', 'Ann', 'Moses', 'Kelvin'], 'Sales':[233, 500, 654, 3455, 864,3456] }
df = pd.DataFrame(data)
df

  Company Persons  Sales
0      FB  Daniel    233
1      FB    Mike    500
2      GO   Ritah    654
3      GO     Ann   3455
4      MS   Moses    864
5      MS  Kelvin   3456

In [5]:
df.groupby('Company').mean()

          Sales
Company
FB        366.5
GO       2054.5
MS       2160.0

In [7]:
df.groupby('Company').sum().loc['FB']

Sales    733
Name: FB, dtype: int64

In [11]:
df.groupby('Company').describe()

        Sales
        count    mean          std    min      25%     50%      75%     max
Company
FB        2.0   366.5   188.797511  233.0   299.75   366.5   433.25   500.0
GO        2.0  2054.5  1980.606094  654.0  1354.25  2054.5  2754.75  3455.0
MS        2.0  2160.0  1832.820777  864.0  1512.00  2160.0  2808.00  3456.0